CSI API ETABS v1
cPropTendon Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropTendon
Public Interface cPropTendon
Dim instance As cPropTendon
public interface class cPropTendon
type cPropTendon =  interface end
The cPropTendon type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of an existing tendon property.
Count
 Retrieves the total number of defined tendon properties in the model.
Delete
 Deletes a specified tendon property.
GetNameList
 Retrieves the names of all defined tendon properties in the model.
GetProp
 Retrieves tendon property definition data.
SetProp
 Defines a tendon property
Top
See Also
Reference
ETABSv1 Namespace